Trabalho1KauaeRIan/codeigniter4-framework-7d393f8/app/Controllers/Home.php

INSERT INTO `Usuarios` (`nome`, `email`, `senha`) VALUES ('Eduardo Wenzel Brião', 'eduardo.weze@gmail.com', 'e21e1232131')
SELECT *
FROM `Usuarios`
---
    public function recebercadastro(): string
    {
        $data = array(
            'nome' => $this->request->getVar('nome'),
            'email' => $this->request->getVar('email'),
            'senha' =>password_hash($this->request->getVar('senha'), PASSWORD_BCRYPT)
        );

        $my_model= new UsuariosModel();
        $my_model->insert($data);
        $result= $my_model->findAll();

SELECT *
FROM `Usuarios`
WHERE `email` = 'juninho@gmail.com'
 LIMIT 1
---
    public function validarlogin(): void
    {

        $data = array(
            'email' => $this->request->getVar('email'),
            'senha' => password_hash($this->request->getVar('senha'), PASSWORD_BCRYPT)
        );

        $email = $data['email'];
        $senha= $data['senha'];
        $my_model= new UsuariosModel();
        $datauser= $my_model->where(['email'=> $email],['senha'=> $senha])->first() ;